lamda=6328*10^(-10);k=2*pi/lamda;%赋值波长、波数
zo=0.3086;                       %物到全息记录面的距离,单位:米
L=5*10^(-3)                      %赋值全息记录面尺寸,单位:米
r=512;c=r;                       %赋值全息记录面的抽样数
x=linspace(-L/2,L/2,c);y=linspace(-L/2,L/2,r);
[x,y]=meshgrid(x,y);             %生成全息记录面的坐标网格
%= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 
%下面赋值物光场
xo=-0.001;yo=0.001;              %发散球面波(物光）的坐标位置(米)
OH=exp(j.*k.*zo).*exp(j.*k.*(((x-xo).^2+(y-yo).^2))/2./zo);  %物光波
%= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 
%下面加入参考光
xr=0.001;yr=-0.001;              %发散球面波(参考光）的中心位置(米)
R=exp(j.*k.*zo).*exp(j.*k.*(((x-xr).^2+(y-yr).^2))/2./zo);  %参考球面光波
%= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 
%下面计算参、物光在全息记录面上的干涉,得到全息图
inter=OH+R;                      % 使参、物光干涉
II=inter.*conj(inter);           %干涉得到全息图
figure,imshow(II,[]),title('基元全息图')
%= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 
%下面计算再现
holo=fftshift(fft2(II)); 
Ii=holo.*conj(holo);
figure,imshow(Ii,[0,max(max(Ii))./2000]),colormap(pink),title('再现像')