a=imread('单孔空洞d10mm-10V-初载.bmp');  %读入加载前的像面离轴全息图
a=double(a(129:896,:,2));                %从全息图的绿光层中读取一部分
b=imread('单孔空洞d10mm-10V-12kg.bmp');  %读入加载后的像面离轴全息图
b=double(b(129:896,:,2)); 
%= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =
af=fftshift(fft2(a));                    %将全息图转换到频域
figure,imshow(log(abs(af)),[])           %显示频谱
AF=zeros(768,1024);                      %预设滤波后的频谱
AF(91:291,514:714)=af(91:291,514:714);   %滤波，只保留+1级
UA=ifft2(AF);                            %作逆傅里叶变换重构O1R*
pha=angle(UA);                           %重建O1R*的相位
%= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =
bf=fftshift(fft2(b));                    %将全息图转换到频域
BF=zeros(768,1024);                      %预设滤波后的频谱
BF(91:291,514:714)=bf(91:291,514:714);   %滤波，只保留+1级
UB=ifft2(BF);                            %作逆傅里叶变换重构O2R*
phb=angle(UB);                           %重建O2R*的相位
%= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =
U= exp(j.*phb)./ exp(j.*pha);
ph= angle(U);                            %重建O2R*与O1R*的相位差
figure,imshow(ph,[])                     %显示重建相位
figure,plot(ph(400,:))                   %绘制剖线